app/controllers/treinamentos_controller.rb

SELECT * FROM `treinamentos` WHERE (`treinamentos`.`codigo` = 'java-oo') LIMIT 1
---
  def show
    @treinamento = Treinamento.find_by_codigo(params[:id])